using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading.Tasks;
using System.IO;
using System.Text.RegularExpressions;

namespace KPBIN_Renderer
{

    /*
    [StructLayout(LayoutKind.Explicit)]
    public struct dKPLayer_s
    {
        public enum LayerTypes
        {
            OBJECTS, DOODADS, PATHS
        };

        [FieldOffset(0)] public LayerTypes type;
        [FieldOffset(4)] public byte alpha;
        [FieldOffset(5)] public byte[] _padding = new byte[3];

        [FieldOffset(8)] GXTexObj *tileset;
        [FieldOffset(0xC)] int sectorLeft;
        [FieldOffset(0x10)] int sectorTop;
        [FieldOffset(0x14)] int sectorRight;
        [FieldOffset(0x18)] int sectorBottom;
        [FieldOffset(0x1C)] ushort[] indices;

        [FieldOffset(8)] int doodadCount;
        [FieldOffset(0xC)] List<dKPDoodad_s> *doodads;

        [FieldOffset(8)] int nodeCount;
        [FieldOffset(0xC)] List<dKPNode_s> *nodes;
        [FieldOffset(0x10)] int pathCount;
        [FieldOffset(0x14)] List<dKPPath_s> *paths;

    }
    

    [StructLayout(LayoutKind.Explicit)]
    public struct GXTexObj
    {
        [FieldOffset(0)] public uint _0;
        [FieldOffset(4)] public uint _4;
        [FieldOffset(8)] public uint formatStuff;

        [FieldOffset(0xC)] public List<byte> *rawPicture;
        [FieldOffset(0xC)] public string *tilesetPath;

        [FieldOffset(0x10)] public uint _10;
        [FieldOffset(0x14)] public uint _14;
        [FieldOffset(0x18)] public uint _18;

        [FieldOffset(0x1C)] public ushort resolutionStuff;
        [FieldOffset(0x1E)] public ushort _1E;
    }
    */

    public static class Globals
    {
        public static Dictionary<uint, GXTexObj> gxInstancesDict = new Dictionary<uint, GXTexObj>();
        public static Dictionary<uint, dKPLayer_s> layerInstancesDict = new Dictionary<uint, dKPLayer_s>();
    }

    public class dKPLayer_s
    {
        // Common
        public enum LayerTypes
        {
            OBJECTS, DOODADS, PATHS
        };

        public LayerTypes type;
        public byte alpha;

        // OBJECTS
        public GXTexObj tileset = new GXTexObj();
        public int sectorLeft;
        public int sectorTop;
        public int sectorRight;
        public int sectorBottom;
        public int boundLeft;
        public int boundTop;
        public int boundRight;
        public int boundBottom;
        public List<ushort> indices = new List<ushort>();

        // DOODADS
